{
  "nom": "Cuvelier",
  "prenom": "Maxime",
  "skills": [
    "html",
    "css",
    "javascript",
    "react",
    "nextjs",
    "tailwind"
  ],
  "projects": [
    {
      "name": "Application Kasa",
      "description": "Un site web simple réalisé avec React",
      "slug": "Kasa",
      "github": "https://github.com/MaxCuvelier/Kasa",
      "image": "/images/Kasa.png",
      "skills": ["javascript", "css", "react"],
      "details": "Projet scolaire, Openclassroom, 2025",
      "contexte": "Le site de Kasa est une application de location immobilière. J'ai eu l'occasion de travailler sur leur projet de refonte totale pour passer à une stack complète en JavaScript avec NodeJS côté back-end, et React côté front-end.",
      "fonction": "Mon poste était celui de développeur front-end et consistait à démarrer le projet React et développer l’ensemble de l’application, les composants React, les routes React Router, en suivant les maquettes Figma.",
      "bulletpoint": ["Initialiser le projet et ajouter le React router", "Création des pages et intégration en suivant les maquettes", "Création du carrousel de la page logement", "Intégration dynamique de la page logement via la back-end"]
    },
    {
      "name": "Application ArgentBank",
      "description": "Une application web simple pour gérer le compte bancaire d'un utilisateur",
      "slug": "ArgentBank",
      "github": "https://github.com/MaxCuvelier/ArgentBank",
      "image": "/images/ArgentBank.png",
      "skills": ["javascript", "css", "react"],
      "details": "Projet scolaire, Openclassroom, 2025",
      "contexte": "ArgentBank est une banque en ligne, j'ai rejoint le projet en tant que développeur front-end afin de mettre en place le nouveau système d'authentification des utilisateurs pour cette application React.",
      "fonction": "Mon poste était celui de développeur front-end avec comme objectif celui d'intégrer la page d'accueil et la page utilisateur ainsi que gérer les informations de celui-ci via l'utilisation de Redux store afin d'afficher les données correspondantes à l'utilisateur et pouvoir les modifier via un formulaire.",
      "bulletpoint": ["installer et intégrer l'application", "mettre en place le state global redux et la connection de l'utilisateur", "intégrer le formulaire pour changer les information utilisateur"]
    },
    {
      "name": "Portfolio Sophie Bluel",
      "description": "un site web de type portfolio réaliser en html, css et javaScript",
      "slug": "SophieBluel",
      "github": "https://github.com/MaxCuvelier/SophieBluel",
      "image": "/images/SophieBluel.png",
      "skills": ["javascript", "css", "seo"],
      "details": "Projet scolaire, Openclassroom, 2024",
      "contexte": "L’agence ArchiWebos m'a missionné pour aider sur la conception du site portfolio d’une architecte d’intérieur en tant que développeur front-end.",
      "fonction": "Mon poste était celui de développeur front-end avec comme objectif d'intégrer la page d'accueil sur laquelle figurent les différents travaux dynamiquement, la possibilité de se connecter en tant qu'administrateur afin d'apporter des modifications aux travaux et une modale permettant d'ajouter des travaux.",
      "bulletpoint": ["création de la page d'accueil avec filtres pour les travaux", "création de la page d'authentification pour le mode administration", "création de la modale et de son formulaire", "gestion des ajouts et suppressions de travaux", "traitement de la réponse API pour l'affichage dynamique des travaux"]
    },
    {
      "name": "Application Ohmyfood",
      "description": "Un site web réalisé entièrement en html et css avec des animation en scss",
      "slug": "Ohmyfood",
      "github": "https://github.com/MaxCuvelier/Ohmyfood",
      "image": "/images/Ohmyfood.png",
      "skills": ["html", "css", "sass"],
      "details": "Projet scolaire, Openclassroom, 2024",
      "contexte": "J'ai intégré Ohmyfood en tant que développeur junior. Il s’agit d’une jeune startup qui voudrait s'imposer sur le marché de la restauration. Déjà présente à New-York, elle souhaite désormais faire sa place à Paris.",
      "fonction": "Ma mission était d'intégrer la version mobile de l'application puis de gérer le responsive pour la page d'accueil ainsi que les pages des restaurants. Il fallait aussi créer des animations en css pour différents éléments du site.",
      "bulletpoint": ["intégrer la version mobile puis le responsive de la page d'accueil", "créer les animations css", "créer les pages de restaurants" , "intégrer le responsive et les animations pour les pages restaurants"]
    }
  ]
}