{
  "nom": "Cuvelier",
  "prenom": "Maxime",
  "skills": [
    "html",
    "css",
    "javascript",
    "react",
    "nextjs",
    "tailwind"
  ],
  "projects": [
    {
      "name": "Application Kasa",
      "description": "Un site web simple réalisé avec React",
      "slug": "Kasa",
      "github": "https://github.com/MaxCuvelier/Kasa",
      "image": "/images/Kasa.png",
      "skills": ["javascript", "css", "react"],
      "explication": "Projet de type scolaire dans le cadre d'une formation Openclassroom. La demande consistait dans la création d'une application de location immobilière en React avec d'abord la création d'un router fonctionnel avec 4 pages, la page d'accueil, la page à propos, la page d'erreur 404 et les pages de logements. Les pages de logements sont générées dynamiquement via le back-end avec notament un carroussel."
    },
    {
      "name": "Application ArgentBank",
      "description": "Une application web simple pour gérer le compte bancaire d'un utilisateur",
      "slug": "ArgentBank",
      "github": "https://github.com/MaxCuvelier/ArgentBank",
      "image": "/images/ArgentBank.png",
      "skills": ["javascript", "css", "react"],
      "explication": "Projet de type scolaire dans le cadre d'une formation Openclassroom. La demande consistait dans la créatin d'une application bancaire réalisé en React permettant de gérer les comptes d'un utilisateur, les données ont été manipulé à l'aide de l'outil Redux permettant une gestion global des states de l'application via le store. L'application devait permettre de se connecter à son profile utilisateur, avoir accès aux comptes bancaire liés à l'utilisateur en question et pouvoir modifier les informations de l'utilisateur tel que le nom grace à un formulaire."
    },
    {
      "name": "Portfolio Sophie Bluel",
      "description": "un site web de type portfolio réaliser en html, css et javaScript",
      "slug": "SophieBluel",
      "github": "https://github.com/MaxCuvelier/SophieBluel",
      "image": "/images/SophieBluel.png",
      "skills": ["javascript", "css", "seo"],
      "explication": "Projet de type scolaire dans le cadre d'une formation Openclassroom. La demande consistait dans la création d'un portfolio personnalisé dans lequel toutes les données sont générées en javascript en utilisant le back-end du site via des demande à l'API fourni, permettant un affichage dynamique et plus durable. Il fallait pouvoir s'identifier via un formulaire afin d'avoir accès à la version edition du site pour avoir la possibilité de manipuler les données stockées en back afin d'ajouter ou de supprimer des travaux, les modifications devaient être traité directement afin d'afficher dynamiquement les nouveaux travaux dans le portfolio."
    },
    {
      "name": "Application Ohmyfood",
      "description": "Un site web réalisé entièrement en html et css avec des animation en scss",
      "slug": "Ohmyfood",
      "github": "https://github.com/MaxCuvelier/Ohmyfood",
      "image": "/images/Ohmyfood.png",
      "skills": ["html", "css", "sass"],
      "explication": "Projet de type scolaire dans le cadre d'une formation Openclassroom. La demande consistait dans la création d'une application qui repertorie les menus de restaurants, réalisée en html et css en mobile first. Il fallait intégrer les différentes pages ainsi que leur responsive, à savoir page d'accueil et pages de chaque restaurants, le projet consistait aussi à utiliser le framework css Sass afin d'implémenter des animations complexes ur différents éléments de l'application."
    }
  ]
}